"""
Задание 3.

Определить, какие из слов «attribute», «класс», «функция», «type»
невозможно записать в байтовом типе с помощью маркировки b''
(без encode decode).

Подсказки:
--- используйте списки и циклы, не дублируйте функции
--- обязательно!!! усложните задачу, "отловив" исключение,
придумайте как это сделать
"""

list_1 = ['attribute', 'класс', 'функция', 'type']
for x in list_1:
    byte_x = bytes(x, 'UTF-8')
    try:
        if len(byte_x) > len(x):
            raise ValueError(
                f'Слово "{x}" невозможно записать байтовом формате')
        else:
            print(f"{byte_x} - тип {type(byte_x)}")
    except ValueError:
        print(f'Слово "{x}" невозможно записать байтовом формате')
