"""
Задание 2.

Каждое из слов «class», «function», «method» записать в байтовом формате
без преобразования в последовательность кодов
не используя!!! методы encode и decode)
и определить тип, содержимое и длину соответствующих переменных.

Подсказки:
--- b'class' - используйте маркировку b''
--- используйте списки и циклы, не дублируйте функции
"""
list_1 = ['class', 'function', 'method']
for x in list_1:
    byte_x = bytes(x, 'utf-8')
    print(f"{x}: {byte_x} - в байтовом формате, "
          f"тип {type(byte_x)}, длина - {len(byte_x)}")
