'''2. Реализовать функцию, принимающую два числа (позиционные аргументы)
и выполняющую их деление. Числа запрашивать у пользователя,
предусмотреть обработку ситуации деления на ноль (try except).
'''


def my_func(a, b):
    return a / b


a = float(input("Введите первое число: "))
b = float(input("Введите второе число: "))
try:
    print(my_func(a, b))
except ZeroDivisionError:
    print("Вы что? Пытаетесь делить на 0!?")
