'''
Задача 16: Требуется вычислить, сколько раз встречается некоторое число X
в массиве A[1..N]. Пользователь в первой строке вводит натуральное число
N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai.
Последняя строка содержит число X
'''

import random
n = int(input("Введите число элементов массива: "))
list_1 = []
for i in range(n):
    list_1.append(random.randint(1, 50))
print(*list_1)
x = int(input("Введите число, которое нужно найти: "))
print(list_1.count(x))