'''
Задача 22: Даны два неупорядоченных набора целых чисел (может быть,
с повторениями). Выдать без повторений в порядке возрастания все те числа,
которые встречаются в обоих наборах.
Пользователь вводит 2 числа. n - кол-во элементов первого множества.
m - кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.
'''

n = int(input("Введите число элементов первого набора: "))
m = int(input("Введите число элементов второго набора: "))
list_1 = []
for i in range(n):
    list_1.append(int(input()))
print(*list_1, "- первый набор чисел")

list_2 = []
for i in range(m):
    list_2.append(int(input()))
print(*list_2, "- второй набор чисел")
print(sorted(set(list_1 + list_2)), "- Отсортированное суммарное множество")