'''
3. Реализовать функцию, принимающую несколько параметров,
описывающих данные пользователя: имя, фамилия, год рождения, город проживания,
email, телефон.
Функция должна принимать параметры как именованные аргументы.
Реализовать вывод данных о пользователе одной строкой.

Пример:
Иван Иванов 1846 года рождения, проживает в городе Москва,
email: jackie@gmail.com, телефон: 01005321456
'''


def pers_func(name, surname, year, city, mail, tel_number):
    print(f"{name} {surname} {year} года рождения, проживает в городе "
          f"{city}, email: {mail}, телефон: {tel_number}")


pers_func(name='Иван', surname='Иванов', year=1987, city='Тверь',
          mail='yttt@gmail.com', tel_number=89899009)
