'''Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
Сколько журавликов сделал каждый ребенок,
если известно, что Петя и Сережа сделали одинаковое количество журавликов,
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
*Пример:*
6 -> 1  4  1
24 -> 4  16  4
    60 -> 10  40  10
'''


class NewEx(Exception):
    pass


while True:
    try:
        s = int(input("Введите количество сделанных журавликов: "))
        if s < 0 or s % 6 != 0:
            raise NewEx()
        else:
            print(f"Количество журавликов, сделанное Петей: {int(s / 6)}")
            print(f"Количество журавликов, сделанное Серёжей: {int(s / 6)}")
            print(f"Количество журавликов, сделанное Катей: {int(4 * s / 6)}")
            break
    except NewEx:
        print("Нужно вводить положительное число, кратное 6")
        continue
    except ValueError:
        print("Вы ввели строку, а не число")
        continue
