'''Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
Поскольку разобраться в его кричалках не настолько просто, насколько легко он
их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть,
если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
Фраза может состоять из одного слова, если во фразе несколько слов,
то они разделяются дефисами. Фразы отделяются друг от друга пробелами.
Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”,
если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

*Пример:*

**Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да
    **Вывод:** Парам пам-пам
'''

my_str = input("Введите строку ").split(" ")
list_1 = []
for x in my_str:
    count_1 = 0
    for i in x:
        if i in 'ауеыоэяию':
            count_1 += 1
    list_1.append(count_1)
res_str = ""
for x in list_1:
    if x != list_1[0]:
        res_str = "Пам парам"
        break
    else:
        res_str = "Парам пам-пам"
print(res_str)
