'''Задание 6. В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.Через рекурсию'''

import random


def number_finder(x, y, limit):
    if y == -1:
        y = int(input('Введите число '))
    elif y < x:
        y = int(input("Ваше число меньше загаданного. Введите новое: "))
    else:
        y = int(input("Ваше число больше загаданного. Введите новое: "))
    if limit == 0:
        print(f"Вы не угадали. Было загадано {x}")
    elif y == x:
        print(f"Вы угадали. Было загадано {x}")
    else:
        number_finder(x, y, limit - 1)


number_finder(random.randint(0, 100), -1, 10)
