'''
Задание 7. Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
'''


def func1(n):
    if n == 0:
        return 0
    else:
        return n + func1(n - 1)


n = int(input("Введите число: "))
print(f"n(n+1)/2 = {n * (n + 1) / 2}")
print(f"Сумма чисел от 1 до {n} - {func1(n)}")
